In [5]:
import pandas as pd
import numpy as np
from datetime import datetime
import math

In [10]:
# Reading the User Demographics Excel file to Pandas DataFrame 
df1 = pd.read_excel("/content/User Demographics.xlsx")
df1

      User Id State (entered by user) Gender
0    A9247B21           Uttar Pradesh      M
1    F3C79376            Chhattisgarh      F
2    1CC6DCF8               Jharkhand      M
3    69A3C687           Uttar Pradesh      M
4    FF5B5B7F               Karnataka      M
..        ...                     ...    ...
995  6132EE3F             West Bengal      M
996  6F7CB4FF          Madhya Pradesh      M
997  B509489A             Utharakhand      M
998  C9A9F3D3             West Bengal      M
999  4E1E927A           Uttar Pradesh      F

[1000 rows x 3 columns]

In [9]:
# Reading the Daily User-wise Revenue data Excel file to Pandas DataFrame 
df2 = pd.read_excel("/content/Daily User-wise Revenue data.xlsx")
df2

            Date   User id  Revenue collected
0     2021-04-01  FF5B5B7F                 53
1     2021-04-01  18427542                 68
2     2021-04-01  C0307F5B                 85
3     2021-04-01  C56C2457                 90
4     2021-04-01  E7C82918                 75
...          ...       ...                ...
14985 2021-04-30  F268AC1E                 48
14986 2021-04-30  2A8C083D                 56
14987 2021-04-30  1DECEC9C                 68
14988 2021-04-30  6F7CB4FF                 39
14989 2021-04-30  C9A9F3D3                  5

[14990 rows x 3 columns]

In [13]:
# Correction in the name of Attribute
df3 = df2.rename(columns={'User id':'User Id'})

In [14]:
# Merging the Datafrmae using Key Atrribute - User Id
df = df1.merge(df3, on='User Id', how='left')
df

        User Id State (entered by user) Gender       Date  Revenue collected
0      A9247B21           Uttar Pradesh      M 2021-04-03                4.0
1      A9247B21           Uttar Pradesh      M 2021-04-04               10.0
2      A9247B21           Uttar Pradesh      M 2021-04-10               33.0
3      A9247B21           Uttar Pradesh      M 2021-04-11               26.0
4      A9247B21           Uttar Pradesh      M 2021-04-17               43.0
...         ...                     ...    ...        ...                ...
14986  4E1E927A           Uttar Pradesh      F 2021-04-11               76.0
14987  4E1E927A           Uttar Pradesh      F 2021-04-17              105.0
14988  4E1E927A           Uttar Pradesh      F 2021-04-18               84.0
14989  4E1E927A           Uttar Pradesh      F 2021-04-24               85.0
14990  4E1E927A           Uttar Pradesh      F 2021-04-25               94.0

[14991 rows x 5 columns]

Q-1) Which are the top-5 states in terms of Revenue offered in the Month of April? How much revenue was collected from each of these states

In [15]:
States_vs_Revenue = df.groupby("State (entered by user)")[["Revenue collected"]].sum()
States_vs_Revenue.nlargest(5, ['Revenue collected']) # Print Top 5 states in term of Revenue

                         Revenue collected
State (entered by user)
Karnataka                          58407.0
Utharakhand                        44657.0
Madhya Pradesh                     40016.0
Tamil Nadu                         39647.0
Bihar                              39235.0

Q-2) What is the average number of users active on the App per day?

In [49]:
# Finding Total number of Active Users per Day
Active_user = df[["Date", "User Id"]].copy()
Active_user.sort_values(by='Date')

Final_df = df.groupby('Date')['User Id'].count()
Final_df

print('Number of Active User per Day', (Final_df))

Number of Active User per Day Date
2021-04-01    347
2021-04-02    341
2021-04-03    951
2021-04-04    947
2021-04-05    345
2021-04-06    344
2021-04-07    346
2021-04-08    346
2021-04-09    338
2021-04-10    936
2021-04-11    935
2021-04-12    342
2021-04-13    344
2021-04-14    338
2021-04-15    338
2021-04-16    336
2021-04-17    935
2021-04-18    939
2021-04-19    337
2021-04-20    348
2021-04-21    343
2021-04-22    341
2021-04-23    340
2021-04-24    927
2021-04-25    931
2021-04-26    333
2021-04-27    340
2021-04-28    341
2021-04-29    331
2021-04-30    330
Name: User Id, dtype: int64

In [50]:
# Finding the Average Active Users per Day
Final_df2 = df.groupby('Date')['User Id'].count().mean()
math.ceil(Final_df2) # This function converts float value into Intger Because Users Value always be in Integer
print(f'Number of Active User per day - {math.ceil(Final_df2)}')

Number of Active User per day - 500

Q-3) What is the average revenue collected per user per day?

In [51]:
user_vs_Revenue = df.groupby(['User Id'])['Revenue collected'].agg(lambda x: x.unique().mean())
user_vs_Revenue # Print Average Revenue collected per user per day

User Id
00395C20    31.458333
00583276     6.000000
008B558C    57.769231
0099AD07    38.333333
01C41039    41.375000
              ...
FEFA03B7    37.375000
FF08D5E5    11.400000
FF2FC3C1    59.166667
FF5B5B7F    57.300000
FFAD51FD    42.857143
Name: Revenue collected, Length: 1000, dtype: float64

# **Bonus Question - Other Insights from the Data**

In [52]:
Final_df3 = df.groupby('Gender')['Revenue collected'].sum()
Final_df3 # Creating Dataframe by Gender Vs Revenue Collected

Gender
F    245867.0
M    551910.0
Name: Revenue collected, dtype: float64

Insights -

1) From the obove analysis, We can see the Male are Contributing more than the fimale.

2) The total Revenue collected by the Male is Double than the Female.

In [53]:
Final_df # Print Total Number of Active User Per Day

Date
2021-04-01    347
2021-04-02    341
2021-04-03    951
2021-04-04    947
2021-04-05    345
2021-04-06    344
2021-04-07    346
2021-04-08    346
2021-04-09    338
2021-04-10    936
2021-04-11    935
2021-04-12    342
2021-04-13    344
2021-04-14    338
2021-04-15    338
2021-04-16    336
2021-04-17    935
2021-04-18    939
2021-04-19    337
2021-04-20    348
2021-04-21    343
2021-04-22    341
2021-04-23    340
2021-04-24    927
2021-04-25    931
2021-04-26    333
2021-04-27    340
2021-04-28    341
2021-04-29    331
2021-04-30    330
Name: User Id, dtype: int64

Insights - 

1) From the Above Dataframe, We notice that the Number of Active Users are Increasing on Weekends